Revit 2024 API
AnalysisDisplayStyleMarkerType Enumeration
 Marker types for Markers and Text settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Since: 2011
Syntax
C#
public enum AnalysisDisplayStyleMarkerType
Visual Basic
Public Enumeration AnalysisDisplayStyleMarkerType
Visual C++
public enum class AnalysisDisplayStyleMarkerType
Members
Member name | Description
Circle
Square
Triangle
See Also
Autodesk.Revit.DB.Analysis Namespace